# InvalidRoofCurveloopError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..InvalidRoofCurveloopError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Base sketch for roof is invalid
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidRoofCurveloopError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidRoofCurveloopError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidRoofCurveloopError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace